app/controllers/home_controller.rb

  def listing_user
    @members = Member.all
---
SELECT `members`.* FROM `members`

  def edit
    @member = Member.find_by(id: params[:id])
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 17 LIMIT 1

  def update
    @member = Member.find_by(id: params[:id])
    @contact = @member.contact
    if params[:member][:password].present?
      @member.update(member_params)
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` IS NULL LIMIT 1
SELECT  `members`.* FROM `members` LIMIT 1
UPDATE `contacts` SET `mobile` = '987456321', `address` = 'qwerty' WHERE `contacts`.`id` = 1
UPDATE `members` SET `image_file_name` = 'daisy-pollen-flower-nature-87840.jpeg', `image_content_type` = 'image/jpeg', `image_file_size` = 110090, `image_updated_at` = '2018-01-31 04:42:28', `picture_file_name` = 'pexels-photo.jpg', `picture_content_type` = 'image/jpeg', `picture_file_size` = 1375004, `picture_updated_at` = '2018-01-31 04:42:28', `encrypted_password` = '$2a$11$br5kZdSwVRSIJc7QI4/qfevjEzqegqUngG06OA4eeB1ktVeKz1y4m', `updated_at` = '2018-01-31 04:42:29' WHERE `members`.`id` = 15

  def show
    @member = Member.find_by_id(params[:id])
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 17 LIMIT 1

  def otp_verify
    @member = Member.find_by(params[:user_id])
---
SELECT  `members`.* FROM `members` WHERE (16) LIMIT 1