app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.all

INSERT INTO `movies` (`name`, `created_at`, `updated_at`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`) VALUES ('my first movie', '2018-01-31 11:05:49', '2018-01-31 11:05:49', 'image-4.jpg', 'image/jpeg', 17287, '2018-01-31 11:05:49')
---
  def create
    @movie = Movie.new(movie_params)
    @movie.save

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 18 LIMIT 1
---
  def update_cropping_image
    if params[:commit] != "Don't Crop"
      custom_theme =  Movie.find_by(id: params["movie"]["theme_id"])

UPDATE `movies` SET `photo_file_name` = 'f4.jpg', `photo_file_size` = 115019, `photo_updated_at` = '2018-06-08 06:17:37', `updated_at` = '2018-06-08 06:17:37' WHERE `movies`.`id` = 3
---
  def update
    @movie.update(movie_params)

DELETE FROM `movies` WHERE `movies`.`id` = 8
---
  def destroy
    @movie.destroy

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
  def upvote
    @movie = Movie.find(params[:id])

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
  def downvote
    @movie = Movie.find(params[:id])

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 8 LIMIT 1
---
    def set_movie
      @movie = Movie.find(params[:id])