app/controllers/registration_controller.rb

INSERT INTO `members` (`email`, `encrypted_password`, `created_at`, `updated_at`, `username`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `picture_file_name`, `picture_content_type`, `picture_file_size`, `picture_updated_at`) VALUES ('sdf@s.c', '$2a$11$6ckMts2J6TxbUYKmntTLZOSEltwqshMHaRAazjoJBYf4uomBrrBgK', '2018-01-29 05:28:38', '2018-01-29 05:28:38', 'sdff', 'i9.jpg', 'image/jpeg', 121546, '2018-01-29 05:28:38', 'i2.jpg', 'image/jpeg', 141086, '2018-01-29 05:28:38')
INSERT INTO `contacts` (`mobile`, `address`, `member_id`) VALUES ('12365478910', 'sdfhskdhgdf', 1)
---
  def create
    debugger
    @member = Member.new(member_params)
    @contact = Contact.new(contact_params)
    @member.valid?

    if @member.errors.blank?
      @member.save
      @contact.member = @member
      @contact.save